cats99/app/controllers/cats_controller.rb

  def create
    Cat.create!(cat_params)
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
   cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    @cat = Cat.find(params[:id])
    @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "male"], ["description", "    doggo1\r\n  "], ["updated_at", "2018-09-11 23:51:32.858372"], ["id", 7]]